app/controllers/ail_pmu_controller.rb

SELECT  "ail_pmus".* FROM "ail_pmus"   ORDER BY "ail_pmus"."id" DESC LIMIT 1
---
  def set_credentials
    @user_name = "NGSER"
    @password = "secure1!"
    @terminal_id = "10000"
    @operator_id = "1"
    @operator_pin = "1"
    @audit_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s
    @message_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..17]
    @user_id = "1234"
    @confirm_id = (AilPmu.last.transaction_id rescue "")

INSERT INTO "ail_pmu_logs" ("created_at", "error_code", "operation", "remote_ip_address", "response_body", "sent_params", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---

    request.run

    AilPmuLog.create(operation: 'Prise de pari', transaction_id: @message_id, error_code: @error_code, sent_params: body, response_body: response_body, remote_ip_address: remote_ip_address)