app/controllers/civilities_controller.rb

  def api_list
    @civilities = Civility.all
---
SELECT "civilities".* FROM "civilities"