app/controllers/ludwin_api_controller.rb


    request.run

    LudwinLog.create(operation: 'Liste complète des sports', transaction_id: transaction_id, language: language, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "remote_ip_address", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"


    request.run

    LudwinLog.create(operation: "Affichage d'un sport spécifique", transaction_id: transaction_id, language: language, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"


    request.run

    LudwinLog.create(operation: 'Liste complète des tournois', transaction_id: transaction_id, language: language, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "remote_ip_address", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"


    request.run

    LudwinLog.create(operation: 'Liste complète des tournois', transaction_id: transaction_id, language: language, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "remote_ip_address", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def api_list_prematch_data
    remote_ip_address = request.remote_ip
    language = 'FR'
    transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..17]
    @error_code = ''
    @error_description = ''
    response_body = ''
    response_code = ''
    url = "https://sports4africa.com/testUSSD/getEvent?system_code=PD&type=FULL&isLive=0&len=#{language}"

    request = Typhoeus::Request.new(url, followlocation: true, method: :get, ssl_verifypeer: false, ssl_verifyhost: 0)

    request.on_complete do |response|
      if response.success?
        response_body = response.body
        @sports_list = (Nokogiri::XML(response_body).xpath('//SportMobile') rescue nil)

        if @sports_list.blank?
          @error_code = '4001'
          @error_description = 'Error while parsing XML.'
        end
      else
        @error_code = '4000'
        @error_description = 'Unavailable resource.'
      end
    end

    request.run

    LudwinLog.create(operation: "Liste complète des données d'avant match", transaction_id: transaction_id, language: language, error_code: @error_code, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "response_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"


    request.run

    LudwinLog.create(operation: 'Liste complète des paris', transaction_id: transaction_id, language: language, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"


    request.run

    LudwinLog.create(operation: "Affichage d'un pari spécifique", transaction_id: transaction_id, language: language, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "language", "operation", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def api_sell_coupon
    remote_ip_address = request.remote_ip
    transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..17]
    url = 'https://sports4africa.com/testUSSD/doBet'
    license_code = '1000'
    point_of_sale_code = '1000'
    terminal_id = '0'
    account_id = 'scommessina31'
    account_type = '14'
    coupons_body = ''
    body = ''
    @error_code = ''
    @error_description = ''
    response_body = ''
    response_code = ''
    coupons = (JSON.parse(params[:coupons]) rescue nil)
    amount = ''
    coupons_details = ''
    paymoney_wallet_url = (Parameters.first.paymoney_wallet_url rescue "")
---
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

          @error_code = '5002'
          @error_description = 'Coupons details must be an array.'
        else
          @bet = Bet.create(license_code: license_code, pos_code: point_of_sale_code, terminal_id: terminal_id, account_id: account_id, account_type: account_type, transaction_id: transaction_id, amount: amount, win_amount: win_amount)
---
INSERT INTO "bets" ("account_id", "account_type", "amount", "bet_code", "created_at", "draw_code", "event_code", "license_code", "odd", "pal_code", "pos_code", "terminal_id", "transaction_id", "updated_at", "win_amount") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

            odd = (coupon_details["odd"].to_s rescue nil)

            unless pal_code.blank? || event_code.blank? || bet_code.blank? || draw_code.blank? || odd.blank?
              @bet.bet_coupons.create(pal_code: pal_code, event_code: event_code, bet_code: bet_code, draw_code: draw_code, odd: odd)
---
INSERT INTO "bet_coupons" ("bet_code", "bet_id", "created_at", "draw_code", "event_code", "odd", "pal_code", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"


            request.run

            LudwinLog.create(operation: "Prise de pari", transaction_id: transaction_id, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "operation", "remote_ip_address", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def api_cancel_coupon
    remote_ip_address = request.remote_ip
    url = 'https://sports4africa.com/testUSSD/cancelBet'
    license_code = '1000'
    point_of_sale_code = '1000'
    terminal_id = '0'
    transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..17]
    ticket_id = params[:ticket_id]
    @error_code = ''
    @error_description = ''
    response_body = ''
    response_code = ''
    @bet = Bet.where("ticket_id = '#{ticket_id}' AND validated IS TRUE")
---
SELECT "bets".* FROM "bets"  WHERE (ticket_id = 'AE0d0e0f2b' AND validated IS TRUE)

          if !nokogiri_response.blank?
            response_code = (nokogiri_response.xpath('//ReturnCode').at('Code').content rescue nil)
            if response_code == '0' || response_code == '1024'
              @bet.first.update_attributes(cancelled: true, cancelled_at: DateTime.now)
---
UPDATE "bets" SET "cancelled" = $1, "cancelled_at" = $2, "updated_at" = $3 WHERE "bets"."id" = 1  [["cancelled", "f"], ["cancelled_at", "2015-10-18 14:25:12.973180"], ["updated_at", "2015-10-18 14:25:12.975773"]]

      request.run
    end

    LudwinLog.create(operation: "Annulation de pari", transaction_id: transaction_id, error_code: @error_code, sent_body: body, response_body: response_body, remote_ip_address: remote_ip_address)
---
INSERT INTO "ludwin_logs" ("created_at", "error_code", "operation", "remote_ip_address", "response_body", "sent_body", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def api_coupon_payment_notification
    @error_code = ''
    @error_description = ''
    transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..17]
    url = 'https://sports4africa.com/testUSSD/paymentTicket'
    payment_notification_envelope = (Nokogiri::XML(request.body.read) rescue nil)

    if payment_notification_envelope.blank?
      @error_code = '5000'
      @error_description = 'Invalid XML data.'
    else
      ticket_id = (payment_notification_envelope.xpath('//PaymentNotificationRequest').at('TicketSogei').content rescue nil)
      pal_code = (payment_notification_envelope.xpath('//PaymentNotificationRequest/EventTicket').at('CodPal').content rescue nil)
      event_code = (payment_notification_envelope.xpath('//PaymentNotificationRequest/EventTicket').at('CodEvent').content rescue nil)
      bet_code = (payment_notification_envelope.xpath('//PaymentNotificationRequest/EventTicket').at('CodBet').content rescue nil)
      pn_transaction_id = (payment_notification_envelope.xpath('//PaymentNotificationRequest').at('TransactionID').content rescue nil)

      @bet = Bet.where(ticket_id: ticket_id, pal_code: pal_code, event_code: event_code, bet_code: bet_code)
---
SELECT "bets".* FROM "bets"  WHERE "bets"."ticket_id" = 'DD07DE011A1260AEE407' AND "bets"."pal_code" = '14432' AND "bets"."event_code" = '3' AND "bets"."bet_code" = '167'