app/controllers/sexes_controller.rb

  def api_list
    @sexes = Sex.all
---
SELECT "sexes".* FROM "sexes"