app/controllers/users_controller.rb

  def api_create
    creation_mode = CreationMode.find_by_token(params[:creation_mode])

    if creation_mode.blank?
      render text: %Q({"errors":[{"message":"Vous n'avez pas pu être authentifié"}]})
    else
      if params[:password] != params[:password_confirmation]
        render text: %Q({"errors":[{"message":"Le mot de passe et sa confirmation ne concordent pas"}]})
      else
        @status = false
        creation_mode.name == 'USSD' ? confirmed_at = DateTime.now : confirmed_at = nil
        @user = User.new(params.merge({creation_mode_id: creation_mode.id, salt: SecureRandom.base64(8).to_s, confirmation_token: SecureRandom.hex.to_s, uuid: SecureRandom.uuid, confirmed_at: confirmed_at}))

        if @user.save
---
SELECT  "creation_modes".* FROM "creation_modes"  WHERE "creation_modes"."token" = '0504fe0b64c5e08d46c49ab41d33be94' LIMIT 1
INSERT INTO "users" ("birthdate", "civility_id", "confirmation_token", "created_at", "creation_mode_id", "email", "firstname", "lastname", "msisdn", "password", "pseudo", "salt", "sex_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def api_enable_account
    @user = User.find_by_confirmation_token(params[:confirmation_token])

    if @user.blank?
      render text: %Q({"errors":[{"message":"Cet utilisateur n'a pas été trouvé"}]})
    else
      if @user.confirmed_at.blank?
        @user.update_attribute(:confirmed_at, DateTime.now)
---
SELECT  "users".* FROM "users"  WHERE "users"."confirmation_token" = '045ab8398040ac9ff739612919069095' LIMIT 1
UPDATE "users" SET "confirmation_token" = $1, "confirmed_at" = $2, "updated_at" = $3 WHERE "users"."id" = 16  [["confirmation_token", nil], ["confirmed_at", "2015-07-05 12:08:30.387163"], ["updated_at", "2015-07-05 12:08:30.396819"]]

  def api_reset_password
    @user = User.where("msisdn = '#{params[:parameter]}' OR id = #{params[:parameter].to_i} OR email = '#{params[:parameter]}'")

    if @user.blank?
      render text: %Q({"errors":[{"message":"Cet utilisateur n'a pas été trouvé"}]})
    else
      @user.first.update_attribute(:reset_password_token, SecureRandom.hex)
---
SELECT "users".* FROM "users"  WHERE (msisdn = '16' OR id = 16.to_i OR email = '16')
UPDATE "users" SET "reset_password_token" = $1, "updated_at" = $2 WHERE "users"."id" = 16  [["reset_password_token", "74f4aec5c3ad83a4a7980f4af159c36c"], ["updated_at", "2015-07-05 17:22:53.295546"]]

  def api_reset_password_activation
    @user = User.find_by_reset_password_token(params[:reset_password_token])
    password = params[:password]
    password_confirmation = params[:password_confirmation]

    if @user.blank?
      render text: %Q({"errors":[{"message":"Cet utilisateur n'a pas été trouvé"}]})
    else
      if password != password_confirmation
        render text: %Q({"errors":[{"message":"Le mot de passe et sa confirmation ne concordent pas"}]})
      else
        @user.update_attributes(reset_password_token: nil, password_reseted_at: DateTime.now, password: Digest::SHA2.hexdigest(@user.salt + password))
---
SELECT  "users".* FROM "users"  WHERE "users"."reset_password_token" = '0923a41c2fcfc9cace8f1fc44383810f' LIMIT 1
UPDATE "users" SET "password" = $1, "password_reseted_at" = $2, "updated_at" = $3 WHERE "users"."id" = 8  [["password", "a5f07690b75366124e7a128fdb61b4c9eb8e65c2787f9fb69f49b75839a71fa7"], ["password_reseted_at", "2015-07-05 18:00:19.281873"], ["updated_at", "2015-07-05 18:00:19.305448"]]

  def api_update
    @user = User.find_by_id(params[:id])
    if @user.blank?
      render text: %Q({"errors":[{"message":"Cet utilisateur n'a pas été trouvé"}]})
    else
      @status = false
      @user.update_attributes(params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "birthdate" = $1, "email" = $2, "firstname" = $3, "lastname" = $4, "pseudo" = $5, "updated_at" = $6 WHERE "users"."id" = 7  [["birthdate", "1895-10-19"], ["email", "dietricherwane@ive.fr"], ["firstname", "faadae"], ["lastname", "freddy"], ["pseudo", "zort"], ["updated_at", "2015-06-25 08:48:52.343708"]]

  def api_email_login
    if User.authenticate_with_email(params[:email], params[:password]) == true
      @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'dietricherwane@ive.fr' LIMIT 1

  def api_msisdn_login
    if User.authenticate_with_msisdn(params[:msisdn], params[:password]) == true
      @user = User.find_by_msisdn(params[:msisdn])
---
SELECT  "users".* FROM "users"  WHERE "users"."msisdn" = '58908957' LIMIT 1